export const geoPosData = {
  "北海道": {
    "宗谷地方": "011000",
    "上川・留萌地方": {
      "上川地方": "012010",
      "留萌地方": "012020"
    },
    "網走・北見・紋別地方":{
      "網走地方": "013010",
      "北見地方": "013020",
      "紋別地方": "013030"
    },
    "十勝地方": "014030",
    "釧路・根室地方":{
      "根室地方": "014020",
      "釧路地方": "014010"
    },
    "胆振・日高地方":{
      "胆振地方": "015010",
      "日高地方": "015020"
    },
    "石狩・空知・後志地方":{
      "石狩地方": "016010",
      "空知地方": "016020",
      "後志地方": "016030"
    },
    "渡島・檜山地方":{
      "渡島地方": "017010",
      "檜山地方": "017020"
    },
  },
  "東北":{
    "青森県":{
      "津軽": "020010",
      "下北": "020020",
      "三八上北": "020030",
    },
    "岩手県":{
      "内陸": "030010",
      "沿岸北部": "030020",
      "沿岸南部": "030030",
    },
    "宮城県":{
      "東部": "040010",
      "西部": "040020",
    },
    "秋田県":{
      "沿岸": "050010",
      "内陸": "050020",
    },
    "山形県":{
      "村山": "060010",
      "置賜": "060020",
      "庄内": "060030",
      "最上": "060040",
    },
    "福島県":{
      "中通り": "070010",
      "浜通り": "070020",
      "会津": "070030",
    },
  },
  "関東甲信":{
    "茨城県":{
      "北部": "080010",
      "南部": "080020",
    },
    "栃木県":{
      "南部": "090010",
      "北部": "090020",
    },
    "群馬県":{
      "南部": "100010",
      "北部": "100020",
    },
    "埼玉県":{
      "北部": "110020",
      "南部": "110010",
      "秩父地方": "110030",
    },
    "千葉県":{
      "北西部": "120010",
      "北東部": "120020",
      "南部": "120030",
    },
    "東京都":{
      "東京地方": "130010",
      "伊豆諸島北部": "130020",
      "伊豆諸島南部": "130030",
      "小笠原諸島": "130040",
    },
    "神奈川県":{
      "東部": "140010",
      "西部": "140020",
    },
    "山梨県":{
      "中・西部": "190010",
      "東部・富士五湖": "190020",
    },
    "長野県":{
      "北部": "200010",
      "中部": "200020",
      "南部": "200030",
    },
  },
  "北陸":{
    "新潟県":{
      "下越": "150010",
      "中越": "150020",
      "上越": "150030",
      "佐渡": "150040",
    },
    "富山県": {
      "東部": "160010",
      "西部": "160020",
    },
    "石川県": {
      "加賀": "170010",
      "能登": "170020",
    },
    "福井県": {
      "嶺北": "180010",
      "嶺南": "180020",
    },
  },
  "東海":{
    "岐阜県": {
      "美濃地方": "210010",
      "飛騨地方": "210020",
    },
    "静岡県": {
      "中部": "220010",
      "伊豆": "220020",
      "東部": "220030",
      "西部": "220040",
    },
    "愛知県": {
      "西部": "230010",
      "東部": "230020",
    },
    "三重県": {
      "北中部": "240010",
      "南部": "240020",
    }
  },
  "近畿":{
    "滋賀県": {
      "南部": "250010",
      "北部": "250020",
    },
    "京都府": {
      "南部": "260010",
      "北部": "260020",
    },
    "大阪府": "270000",
    "兵庫県": {
      "南部": "280010",
      "北部": "280020",
    },
    "奈良県": {
      "北部": "290010",
      "南部": "290020",
    },
    "和歌山県": {
      "北部": "300010",
      "南部": "300020",
    },
  },
  "中国":{
    "鳥取県": {
      "東部": "310010",
      "中・西部": "310020",
    },
    "島根県": {
      "東部": "320010",
      "西部": "320020",
      "隠岐": "320030",
    },
    "岡山県": {
      "南部": "330010",
      "北部": "330020",
    },
    "広島県": {
      "南部": "340010",
      "北部": "340020",
    },
    "山口県": {
      "西部": "350010",
      "中部": "350020",
      "東部": "350030",
      "北部": "350040",
    },
  },
  "四国":{
    "徳島県": {
      "北部": "360010",
      "南部": "360020",
    },
    "香川県": "370000",
    "愛媛県": {
      "中予": "380010",
      "東予": "380020",
      "南予": "380030",
    },
    "高知県": {
      "中部": "390010",
      "東部": "390020",
      "西部": "390030",
    },
  },
  "九州北部":{
    "福岡県": {
      "福岡地方": "400010",
      "北九州地方": "400020",
      "筑豊地方": "400030",
      "筑後地方": "400040",
    },
    "佐賀県": {
      "南部": "410010",
      "北部": "410020",
    },
    "長崎県": {
      "南部": "420010",
      "北部": "420020",
      "壱岐・対馬": "420030",
      "五島": "420040",
    },
    "熊本県": {
      "熊本地方": "430010",
      "阿蘇地方": "430020",
      "天草・芦北地方": "430030",
      "球磨地方": "430040",
    },
    "大分県": {
      "中部": "440010",
      "北部": "440020",
      "西部": "440030",
      "南部": "440040",
    },
  },
  "九州南部":{
    "宮崎県": {
      "南部平野部": "450010",
      "北部平野部": "450020",
      "南部山沿い": "450030",
      "北部山沿い": "450040",
    },
    "鹿児島県": {
      "薩摩地方": "460010",
      "大隅地方": "460020",
      "種子島・屋久島地方": "460030",
      "奄美地方": "460040",
    },
  },
  "沖縄県":{
    "沖縄本島地方":{
      "本島中南部": "471010",
      "本島北部": "471020",
      "久米島": "471030",
    },
    "大東島地方": "472000",
    "宮古島地方": "473000",
    "八重山地方":{
      "石垣島地方": "474010",
      "与那国島地方": "474020",
    }
  }
} as const;

type GeoPosData = typeof geoPosData;

type ExtractValues<T> = T extends Record<string, infer U>
  ? U extends Record<string, any>
    ? ExtractValues<U>
    : U
  : never;
type FirstTwoChars<T extends string> = T extends `${infer A}${infer B}${string}` ? `${A}${B}` : T;

export type GeoPosId = ExtractValues<GeoPosData>;
export type GeoPosSuggestion = GeoPosId | FirstTwoChars<ExtractValues<GeoPosData>>;

export const flatGeoPosIds: Record<string, string> = (()=>{
  const result = {} as Record<string, string>;
  const get = (data: Record<string, any>, prefix: string) => {
    for (const [key, value] of Object.entries(data)) {
      if (typeof value === "string") {
        result[prefix + key] = value;
      } else {
        get(value, prefix + key + " ");
      }
    }
  }
  get(geoPosData, "");
  return result;
})();

export const geoPosIds = Object.values(flatGeoPosIds);

export const geoPosName = (()=>{
  const result = {} as Record<string, string>;
  const get = (data: Record<string, any>, prefix: string) => {
    for (const [key, value] of Object.entries(data)) {
      if (typeof value === "string") {
        result[value] = `${prefix}${key}`;
      } else {
        get(value, `${prefix}${key} `);
      }
    }
  }
  for(const [key, value] of Object.entries(geoPosData)){
    if (key.match(/沖縄県|北海道/)){
      for (const [key2, value2] of Object.entries(value)){
        if (typeof value2 === "string") {
          result[value2] = `${key}`;
        } else {
          get(value2, `${key} `);
        }
      }
    }else{
      get(value, "");
    }
  }
  return result;
})();
