export const WeatherLabels: Record<string, {
  icon: string;
  weather: string;
}> = {
  "100": {
    "icon": "100",
    "weather": "晴"
  },
  "101": {
    "icon": "101",
    "weather": "晴時々曇"
  },
  "102": {
    "icon": "102",
    "weather": "晴一時雨"
  },
  "103": {
    "icon": "102",
    "weather": "晴時々雨"
  },
  "104": {
    "icon": "104",
    "weather": "晴一時雪"
  },
  "105": {
    "icon": "104",
    "weather": "晴時々雪"
  },
  "106": {
    "icon": "102",
    "weather": "晴一時雨か雪"
  },
  "107": {
    "icon": "102",
    "weather": "晴時々雨か雪"
  },
  "108": {
    "icon": "102",
    "weather": "晴一時雨か雷雨"
  },
  "110": {
    "icon": "110",
    "weather": "晴後時々曇"
  },
  "111": {
    "icon": "110",
    "weather": "晴後曇"
  },
  "112": {
    "icon": "112",
    "weather": "晴後一時雨"
  },
  "113": {
    "icon": "112",
    "weather": "晴後時々雨"
  },
  "114": {
    "icon": "112",
    "weather": "晴後雨"
  },
  "115": {
    "icon": "115",
    "weather": "晴後一時雪"
  },
  "116": {
    "icon": "115",
    "weather": "晴後時々雪"
  },
  "117": {
    "icon": "115",
    "weather": "晴後雪"
  },
  "118": {
    "icon": "112",
    "weather": "晴後雨か雪"
  },
  "119": {
    "icon": "112",
    "weather": "晴後雨か雷雨"
  },
  "120": {
    "icon": "102",
    "weather": "晴朝夕一時雨"
  },
  "121": {
    "icon": "102",
    "weather": "晴朝の内一時雨"
  },
  "122": {
    "icon": "112",
    "weather": "晴夕方一時雨"
  },
  "123": {
    "icon": "100",
    "weather": "晴山沿い雷雨"
  },
  "124": {
    "icon": "100",
    "weather": "晴山沿い雪"
  },
  "125": {
    "icon": "112",
    "weather": "晴午後は雷雨"
  },
  "126": {
    "icon": "112",
    "weather": "晴昼頃から雨"
  },
  "127": {
    "icon": "112",
    "weather": "晴夕方から雨"
  },
  "128": {
    "icon": "112",
    "weather": "晴夜は雨"
  },
  "130": {
    "icon": "100",
    "weather": "朝の内霧後晴"
  },
  "131": {
    "icon": "100",
    "weather": "晴明け方霧"
  },
  "132": {
    "icon": "101",
    "weather": "晴朝夕曇"
  },
  "140": {
    "icon": "102",
    "weather": "晴時々雨で雷を伴う"
  },
  "160": {
    "icon": "104",
    "weather": "晴一時雪か雨"
  },
  "170": {
    "icon": "104",
    "weather": "晴時々雪か雨"
  },
  "181": {
    "icon": "115",
    "weather": "晴後雪か雨"
  },
  "200": {
    "icon": "200",
    "weather": "曇"
  },
  "201": {
    "icon": "201",
    "weather": "曇時々晴"
  },
  "202": {
    "icon": "202",
    "weather": "曇一時雨"
  },
  "203": {
    "icon": "202",
    "weather": "曇時々雨"
  },
  "204": {
    "icon": "204",
    "weather": "曇一時雪"
  },
  "205": {
    "icon": "204",
    "weather": "曇時々雪"
  },
  "206": {
    "icon": "202",
    "weather": "曇一時雨か雪"
  },
  "207": {
    "icon": "202",
    "weather": "曇時々雨か雪"
  },
  "208": {
    "icon": "202",
    "weather": "曇一時雨か雷雨"
  },
  "209": {
    "icon": "200",
    "weather": "霧"
  },
  "210": {
    "icon": "210",
    "weather": "曇後時々晴"
  },
  "211": {
    "icon": "210",
    "weather": "曇後晴"
  },
  "212": {
    "icon": "212",
    "weather": "曇後一時雨"
  },
  "213": {
    "icon": "212",
    "weather": "曇後時々雨"
  },
  "214": {
    "icon": "212",
    "weather": "曇後雨"
  },
  "215": {
    "icon": "215",
    "weather": "曇後一時雪"
  },
  "216": {
    "icon": "215",
    "weather": "曇後時々雪"
  },
  "217": {
    "icon": "215",
    "weather": "曇後雪"
  },
  "218": {
    "icon": "212",
    "weather": "曇後雨か雪"
  },
  "219": {
    "icon": "212",
    "weather": "曇後雨か雷雨"
  },
  "220": {
    "icon": "202",
    "weather": "曇朝夕一時雨"
  },
  "221": {
    "icon": "202",
    "weather": "曇朝の内一時雨"
  },
  "222": {
    "icon": "212",
    "weather": "曇夕方一時雨"
  },
  "223": {
    "icon": "201",
    "weather": "曇日中時々晴"
  },
  "224": {
    "icon": "212",
    "weather": "曇昼頃から雨"
  },
  "225": {
    "icon": "212",
    "weather": "曇夕方から雨"
  },
  "226": {
    "icon": "212",
    "weather": "曇夜は雨"
  },
  "228": {
    "icon": "215",
    "weather": "曇昼頃から雪"
  },
  "229": {
    "icon": "215",
    "weather": "曇夕方から雪"
  },
  "230": {
    "icon": "215",
    "weather": "曇夜は雪"
  },
  "231": {
    "icon": "200",
    "weather": "曇海上海岸は霧か霧雨"
  },
  "240": {
    "icon": "202",
    "weather": "曇時々雨で雷を伴う"
  },
  "250": {
    "icon": "204",
    "weather": "曇時々雪で雷を伴う"
  },
  "260": {
    "icon": "204",
    "weather": "曇一時雪か雨"
  },
  "270": {
    "icon": "204",
    "weather": "曇時々雪か雨"
  },
  "281": {
    "icon": "215",
    "weather": "曇後雪か雨"
  },
  "300": {
    "icon": "300",
    "weather": "雨"
  },
  "301": {
    "icon": "301",
    "weather": "雨時々晴"
  },
  "302": {
    "icon": "302",
    "weather": "雨時々止む"
  },
  "303": {
    "icon": "303",
    "weather": "雨時々雪"
  },
  "304": {
    "icon": "300",
    "weather": "雨か雪"
  },
  "306": {
    "icon": "300",
    "weather": "大雨"
  },
  "308": {
    "icon": "308",
    "weather": "雨で暴風を伴う"
  },
  "309": {
    "icon": "303",
    "weather": "雨一時雪"
  },
  "311": {
    "icon": "311",
    "weather": "雨後晴"
  },
  "313": {
    "icon": "313",
    "weather": "雨後曇"
  },
  "314": {
    "icon": "314",
    "weather": "雨後時々雪"
  },
  "315": {
    "icon": "314",
    "weather": "雨後雪"
  },
  "316": {
    "icon": "311",
    "weather": "雨か雪後晴"
  },
  "317": {
    "icon": "313",
    "weather": "雨か雪後曇"
  },
  "320": {
    "icon": "311",
    "weather": "朝の内雨後晴"
  },
  "321": {
    "icon": "313",
    "weather": "朝の内雨後曇"
  },
  "322": {
    "icon": "303",
    "weather": "雨朝晩一時雪"
  },
  "323": {
    "icon": "311",
    "weather": "雨昼頃から晴"
  },
  "324": {
    "icon": "311",
    "weather": "雨夕方から晴"
  },
  "325": {
    "icon": "311",
    "weather": "雨夜は晴"
  },
  "326": {
    "icon": "314",
    "weather": "雨夕方から雪"
  },
  "327": {
    "icon": "314",
    "weather": "雨夜は雪"
  },
  "328": {
    "icon": "300",
    "weather": "雨一時強く降る"
  },
  "329": {
    "icon": "300",
    "weather": "雨一時みぞれ"
  },
  "340": {
    "icon": "400",
    "weather": "雪か雨"
  },
  "350": {
    "icon": "300",
    "weather": "雨で雷を伴う"
  },
  "361": {
    "icon": "411",
    "weather": "雪か雨後晴"
  },
  "371": {
    "icon": "413",
    "weather": "雪か雨後曇"
  },
  "400": {
    "icon": "400",
    "weather": "雪"
  },
  "401": {
    "icon": "401",
    "weather": "雪時々晴"
  },
  "402": {
    "icon": "402",
    "weather": "雪時々止む"
  },
  "403": {
    "icon": "403",
    "weather": "雪時々雨"
  },
  "405": {
    "icon": "400",
    "weather": "大雪"
  },
  "406": {
    "icon": "406",
    "weather": "風雪強い"
  },
  "407": {
    "icon": "406",
    "weather": "暴風雪"
  },
  "409": {
    "icon": "403",
    "weather": "雪一時雨"
  },
  "411": {
    "icon": "411",
    "weather": "雪後晴"
  },
  "413": {
    "icon": "413",
    "weather": "雪後曇"
  },
  "414": {
    "icon": "414",
    "weather": "雪後雨"
  },
  "420": {
    "icon": "411",
    "weather": "朝の内雪後晴"
  },
  "421": {
    "icon": "413",
    "weather": "朝の内雪後曇"
  },
  "422": {
    "icon": "414",
    "weather": "雪昼頃から雨"
  },
  "423": {
    "icon": "414",
    "weather": "雪夕方から雨"
  },
  "425": {
    "icon": "400",
    "weather": "雪一時強く降る"
  },
  "426": {
    "icon": "400",
    "weather": "雪後みぞれ"
  },
  "427": {
    "icon": "400",
    "weather": "雪一時みぞれ"
  },
  "450": {
    "icon": "400",
    "weather": "雪で雷を伴う"
  }
}